Tekla.Structures.AnalysisInternal.DotAnalysisObject.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.Id
The identifier of the analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.AnalysisObjectType
The type of the analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.FatherObjectType
The type of the father object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.FatherObject2Type
The type of the father object 2.